# 蟹堡王仓库
stock = ['芝士片', '芝士片', '芝麻面包', '芝麻面包', '芝麻面包', '肉饼', '芝士片', '芝麻面包', '芝麻面包', '芝麻面包',
         '肉饼', '芝麻面包', '芝麻面包', '芝士片', '芝麻面包', '芝麻面包', '芝麻面包', '芝麻面包', '肉饼', '肉饼',
         '芝麻面包', '芝麻面包', '芝士片', '肉饼', '芝麻面包', '芝士片', '肉饼', '肉饼', '芝麻面包', '芝麻面包',
         '芝麻面包', '芝士片', '肉饼', '肉饼', '芝麻面包', '芝士片', '芝麻面包', '芝士片', '芝麻面包', '芝士片',
         '芝麻面包', '芝麻面包', '肉饼', '芝士片', '芝士片', '芝麻面包', '芝麻面包', '肉饼', '肉饼', '芝麻面包', '肉饼',
         '芝士片', '芝麻面包', '芝士片', '芝士片', '芝麻面包', '肉饼', '芝士片', '芝麻面包', '芝麻面包', '芝麻面包',
         '芝麻面包', '肉饼', '芝士片', '芝士片', '肉饼', '肉饼', '芝士片', '芝麻面包', '肉饼', '肉饼', '芝麻面包',
         '肉饼', '肉饼', '芝麻面包', '芝士片', '肉饼', '芝士片', '肉饼', '芝麻面包', '芝麻面包', '芝麻面包', '芝麻面包',
         '芝士片', '芝麻面包', '芝麻面包', '芝麻面包', '芝麻面包', '肉饼', '芝麻面包', '芝麻面包', '芝麻面包',
         '芝麻面包', '肉饼', '芝麻面包', '芝士片', '芝麻面包', '芝麻面包', '芝麻面包', '芝士片', '芝士片', '芝士片',
         '芝麻面包', '芝麻面包', '芝麻面包', '芝士片', '芝士片', '肉饼', '芝士片', '芝士片', '芝麻面包', '芝麻面包',
         '芝麻面包', '芝士片', '芝士片', '肉饼', '芝麻面包', '芝麻面包', '肉饼', '芝麻面包', '芝麻面包', '芝麻面包',
         '肉饼', '芝麻面包', '芝士片', '芝麻面包', '芝麻面包', '芝士片', '芝士片', '芝麻面包', '肉饼', '芝麻面包',
         '芝麻面包', '肉饼', '芝麻面包', '芝麻面包', '芝麻面包', '肉饼', '芝士片', '芝麻面包', '肉饼', '肉饼', '肉饼',
         '肉饼', '肉饼', '芝麻面包', '肉饼', '芝麻面包', '芝士片', '芝麻面包', '肉饼', '肉饼', '芝麻面包', '芝士片',
         '芝士片', '芝麻面包', '芝麻面包', '芝麻面包', '芝麻面包', '肉饼', '芝麻面包', '肉饼', '芝麻面包', '芝麻面包',
         '芝麻面包', '芝麻面包', '芝士片', '芝士片', '芝麻面包', '肉饼', '肉饼', '肉饼', '芝麻面包', '芝麻面包',
         '芝麻面包', '芝麻面包', '芝麻面包', '芝士片', '芝麻面包', '芝麻面包', '肉饼', '芝麻面包', '芝麻面包',
         '芝麻面包', '芝士片', '芝士片', '芝士片', '芝麻面包', '肉饼', '肉饼', '肉饼', '芝麻面包', '芝麻面包',
         '芝麻面包', '芝士片', '芝士片', '肉饼', '芝麻面包', '芝麻面包', '芝麻面包', '芝麻面包', '芝士片', '肉饼',
         '芝麻面包', '芝麻面包', '芝麻面包', '芝士片', '芝麻面包']

# 仓库中肉饼数量
meat = 0
# 仓库中芝麻面包数量
bread = 0
# 仓库中芝士片数量
cheese = 0

# 遍历 stock 中每样食材
for i in stock:
# 如果它是“肉饼”
    if i == '肉饼':
        meat += 1
# meat 变量值加一
# 否则，如果它是“芝麻面包”
    elif i == '芝麻面包':
        bread += 1
# bread 变量值加一

# 如果它既不是肉饼也不是芝麻面包，那一定是芝士片
    else:
        cheese += 1
# cheese 变量值加一


# 统计结束，打印每种食材数量
print('海绵宝宝结束清点，发现仓库里：')
print('有 ' + str(meat) + ' 块肉饼')
print('有 ' + str(bread) + ' 片芝麻面包')
print('有 ' + str(cheese) + ' 片芝士片')